package shooting;

import java.awt.Color;
import java.awt.Font;
import java.awt.Graphics;

/******************************************************************************/
/*																			  */
/*残り　クラス																  */
/*																			  */
/*Programinged by Pinsoft with Pintendo and Pintaxerror 2018.				  */
/******************************************************************************/
public class Left {
	/**************************************************************************/
    /* フィールド															  */
    /**************************************************************************/
	MyShip myShip;

	Font leftFont;

	/**************************************************************************/
	/* コンストラクタ														  */
	/**************************************************************************/
	Left(MyShip myShip) {
		leftFont = new Font("sansserif", Font.BOLD, 15);

		this.myShip = myShip;
	}

    /**************************************************************************/
    /* メソッド																  */
    /**************************************************************************/
	public void drawLeft(Graphics g)
	{
		g.setColor(Color.white);
		g.setFont(leftFont);
		g.drawString("残り : " + this.myShip.hp, 290, 30);
	}
}
