package shooting;

import java.awt.Color;
import java.awt.Font;
import java.awt.Graphics;

/*****************************************************************************/
/*																			  */
/*スコア　クラス															  */
/*																			  */
/*Programinged by Pinsoft with Pintendo and Pintaxerror 2018.				  */
/******************************************************************************/
public class Score {
	/**************************************************************************/
    /* フィールド															  */
    /**************************************************************************/
	int score;					//スコア
	Font scoreFont;

	/**************************************************************************/
	/* コンストラクタ														  */
	/**************************************************************************/
	Score() {
		scoreFont = new Font("sansserif", Font.BOLD, 15);
		score = 0;
	}

    /**************************************************************************/
    /* メソッド																  */
    /**************************************************************************/
	public void drawScore(Graphics g)
	{
		g.setColor(Color.white);
		g.setFont(scoreFont);
		g.drawString("score : " + score, 20, 30);
	}
}
